Repository: liulinakaterina/Lab1
Catalog: Parallel_Lab4/localization/task4-*.po
Languages: uk_ua

# CHILD_PROCESS_ALIVE
source: Child process is alive.
uk_ua: Дочірній процес живий.

# CHILD_PROCESS_ALREADY_RUNNING
source: Child process is already running.
uk_ua: Дочірній процес вже запущено.

# CHILD_PROCESS_DOWN
source: Child process is already down.
uk_ua: Дочірній процес більше не існує.

# CHILD_PROCESS_RUNNING
source: Child process is running.
uk_ua: Дочірній процес запущено.

source: Child process started.
uk_ua: Дочірній процес розпочався.

# CHILD_PROCESS_TERMINATED
source: Child process is terminated.
uk_ua: Дочірній процес аварійно завершено.

# DATE_COMMAND
source: date - to write the current date
uk_ua: date - для запису поточної дати

# FATHER_PROCESS_RUNNING
source: Father process is running.
uk_ua: Батьківський процес запущено.

# GENERAL_INFO
source: The script can be used to work with the processes.
uk_ua: Скрипт може бути використаний для роботи з процесами.

# HELP
source: Use -h or --help parameters to see how the script can be used.
uk_ua: Використайте -h або --help параметри для отримання довідки щодо використання скрипта.

# EXIT_CHILD_PROCESS
source: Child process exited.
uk_ua: Дочірній процес завершено.

# EXIT_COMMAND
source: exit - to exit
uk_ua: exit - для виходу

# EXIT_PARENT_PROCESS
source: Parent process exited.
uk_ua: Батьківський процес завершено.

source: Exit program.
uk_ua: Завершення роботи програми.

# INTERRUPTED_CHILD_PROCESS
source: Child process interruption ignored.
uk_ua: Дочірній процес перервано.

# INTERRUPTED_PARENT_PROCESS
source: Parent process interruption ignored.
uk_ua: Батьківський процес перервано.

# KILL_COMMAND
source: kill - to kill child process
uk_ua: kill - для завершення дочірнього процесу

# NO_SIGNAL_ERROR
source: No signal to send.
uk_ua: Сигал для відправки відсутній.

# NO_SIGNAL_TO_PROCESS_ERROR
source: No signal to process.
uk_ua: Сигал для обробки відсутній.

# NOT_VALID_LOG_PARAMATERS
source: Not valid log parameters.
uk_ua: Параметри для логування задано невірно.

# NOT_VALID_OPTION
source: Not valid parameter:
uk_ua: Неправильний параметр:

source: Options:
uk_ua: Опції:

# PARAMETER_HELP
source: Parameter -h - to get short information.
uk_ua: Параметр -h - для виведення скороченої довідки.

# PARAMETER_HELP_DETAILED
source: Parameter --help - to get detailed information.
uk_ua: Параметр --help - для виведення детальної інформації.

# RANDON_NUMBER_COMMAND
source: random - to write random number
uk_ua: random - для запису випадкового числа

# SEE_DETAILS
source: For more details see key --help.
uk_ua: Для перегляду інформації про опції використайте опцію --help.

source: Select command:
uk_ua: Оберіть команду:

# START_COMMAND
source: start - to start child process
uk_ua: start - для старту дочірнього процесу

# STOPPED_CHILD_PROCESS
source: Child process has stopped.
uk_ua: Дочірній процес зупинено.

# STOPPED_PARENT_PROCESS
source: Parent process has stopped.
uk_ua: Батьківський процес зупинено.

# TERMINATED_CHILD_PROCESS
source: Child process terminated.
uk_ua: Дочірній процес аварійно завершено.

# TERMINATED_PARENT_PROCESS
source: Parent process terminated.
uk_ua: Батьківський процес аварійно завершено.

source: Unknown command.
uk_ua: Невідома команда.

source: Unknown error.
uk_ua: Невідома помилка.
